---
kind: property
id: P:Autodesk.Revit.DB.ViewDisplayDepthCueing.FadeTo
source: html/9e113d92-3414-68ff-e0eb-61d934bb7110.htm
---
# Autodesk.Revit.DB.ViewDisplayDepthCueing.FadeTo Property

The fade to defines the maximum fading in per cent.
 Values between 0 and 100.

## Syntax (C#)
```csharp
public int FadeTo { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: The fade to value is not valid. The valid range is 0 to 100.